InformationRegisters/ЗаданияКПереносуДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияКПереносуДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПостановкиВочередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияКПереносуДокументов/Ext/ManagerModule.bsl
Процедура СкопироватьДокументыДолжнику() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 200
	               |	ЗаданияКПереносуДокументов.Объект КАК Объект,
	               |	ЗаданияКПереносуДокументов.ДатаПостановкиВочередь КАК ДатаПостановкиВочередь
	               |ИЗ
	               |	РегистрСведений.ЗаданияКПереносуДокументов КАК ЗаданияКПереносуДокументов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПостановкиВочередь";
	Запрос = Новый Запрос (ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Объект;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Должник") Тогда
			Должник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "Должник");
			Если ЗначениеЗаполнено(Должник) Тогда
				МассивФайлов = Новый Массив;
				ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(Объект, МассивФайлов);
				МассивФайловДолжника = Новый Массив;
				ПрисоединенныеФайлы.ПолучитьПрикрепленныеФайлыКОбъекту(Объект, МассивФайловДолжника);
				Для Каждого ПрисоединенныйФайл Из МассивФайлов Цикл
					Для Каждого ФайлДолжника Из МассивФайловДолжника Цикл
						Если ФайлДолжника.ПутьКФайлу = ПрисоединенныйФайл.ПутьКФайлу И
							ФайлДолжника.Том = ПрисоединенныйФайл.Том Тогда
							Продолжить;
						КонецЕсли;
					КонецЦикла;
					
					НоваяЗаписьФайла = ПрисоединенныйФайл.Скопировать();
					НоваяЗаписьФайла.ВладелецФайла = Должник;
					НоваяЗаписьФайла.Записать();
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Набор = РегистрыСведений.ЗаданияКПереносуДокументов.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Объект);
		Набор.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры
